import { useState } from "react";
import "./FaqPage.css";

export const FaqPage = () => {
    const [open, setOpen] = useState(null);

    const toggle = (i) => {
        setOpen(open === i ? null : i);
    };

    const data = [
        {
            q: "Що таке Kysk?",
            a: "Kysk — це сучасний український стримінговий сервіс для перегляду фільмів і серіалів у зручному та якісному форматі."
        },
        {
            q: "Як оформити підписку?",
            a: "Перейдіть у розділ «Преміум», оберіть тариф та виконайте оплату. Підписка активується миттєво."
        },
        {
            q: "Чи можна використовувати Kysk без підписки?",
            a: "Так, частина контенту доступна безкоштовно. Але преміум-підписка відкриває додаткові можливості, ексклюзиви та перегляд без реклами."
        },
        {
            q: "Чи безпечно зберігати платіжні дані в Kysk?",
            a: "Так. Дані шифруються, не зберігаються у відкритому вигляді та обробляються виключно сертифікованими міжнародними платіжними системами."
        },
        {
            q: "Чи є субтитри та різні звукові доріжки?",
            a: "Так. У багатьох фільмів доступні українські та оригінальні звукові доріжки, а також субтитри. Ми постійно розширюємо доступність контенту."
        },
        {
            q: "Як скасувати підписку?",
            a: "У вашому профілі є розділ «Керування підпискою», де можна вимкнути автоматичне продовження в будь-який момент."
        }
    ];


    return (
        <div className="faq_page">

            <h1 className="faq_title">Запитання та відповіді</h1>
            <div className="faq_line"></div>

            <div className="faq_list">
                {data.map((item, i) => (
                    <div className="faq_item" key={i}>
                        <div className="faq_question" onClick={() => toggle(i)}>
                            <span>{item.q}</span>
                            <div className={`faq_icon ${open === i ? "open" : ""}`}></div>
                        </div>

                        <div className={`faq_answer ${open === i ? "show" : ""}`}>
                            {item.a}
                        </div>
                    </div>
                ))}
            </div>
        </div>
    );
};
